Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Seven Years Later.tmx
Source language: en
Languages: es_419

source: nothing has changed in this house.
es_419: En casa no cambió nada.

source: And now I can't contact dad or the others.
es_419: Y ahora no me puedo comunicar con papá ni con los demás.

source: yeah, mom! she's lost it!
es_419: ¡Sí, ma! ¡Está loca!

source: Anyway, do you have your phone with you?
es_419: En fin, ¿tienes tu teléfono encima?

source: save my number, okay?
es_419: Agenda mi número, ¿sí?

source: ...someone was texting me...
es_419: … me mandaron un mensaje…

source: I thought it all was because of that bracelet.
es_419: Pensé que todo era por ese brazalete.

source: you disappeared...
es_419: Desapareciste…

source: well, you're four years old, aren't you? haha!
es_419: Porque tienes cuatro años, ¿no? ¡Ja, ja!

source: why do you ask?
es_419: ¿Por qué preguntas?

source: Yeah.
es_419: Sip.

source: it was obvious that ezra rushed to lembang to prevent me from disappearing again...
es_419: Era obvio que Ezra fue hasta Lembang para evitar que desapareciera de nuevo…

source: Wait!
es_419: ¡Espera!

source: let's see what he'll reply.
es_419: Veamos qué responde.

source: Of course!
es_419: ¡Claro!

source: ...I told Mom everything.
es_419: … le conté todo a mamá.

source: she ran and went missing.
es_419: Salió corriendo y desapareció.

source: yeah, showing off his charm.
es_419: Sip, para presumir su encanto.

source: maybe I should ask ezra later.
es_419: Mejor le pregunto a Ezra después.

source: I knew the consequences.
es_419: Conozco las consecuencias.

source: I did check if she hurt her head or anything...
es_419: Le revisé la cabeza para ver si se había golpeado…

source: He's always the top student.
es_419: Siempre es el mejor estudiante.

source: it was the feeling of not knowing anything.
es_419: Sino la sensación de no saber nada.

source: ...the girl I thought was dead returned alive...
es_419: … la chica que creía muerta regresó, sana y salva.

source: Let's go swimming!
es_419: ¡Vamos a nadar!

source: Y-You're not a ghost, are you???
es_419: N-no eres un fantasma, ¿o sí?

source: Thank goodness!
es_419: ¡Menos mal!

source: I...
es_419: No…

source: Then he goes, "you should've taught your sister better!"
es_419: Y me dirá: "¡tienes que ser un mejor ejemplo para tu hermana!"

source: I understand.
es_419: Entiendo.

source: meet gavin...
es_419: ¡Conozcan a Gavin…

source: ezra headed home and stayed in bandung. he rushed to lembang as he was worried that I would dissapear again.
es_419: Ezra fue a casa y se quedó en Bandung. Pero viajó a Lembang enseguida porque le preocupaba que desapareciera de nuevo.

source: ah, no, I'm okay.
es_419: Ah, no. Estoy bien.

source: Couldn't be more surprised...
es_419: ¡Qué sorpresa!

source: What's going on??
es_419: Qué le anda pasando??

source: ...and then back to year 2021.
es_419: y luego regresaste al 2021.

source: ...your grandma...
es_419: que tu abuela

source: ...is dad coming home?
es_419: … ¿papá vendrá a casa?

source: I felt insecure right away after meeting her.
es_419: Me sentí un poco incómoda cuando la conocí.

source: not everyone can accept that you suddenly came back...
es_419: No todos pueden aceptar que hayas vuelto tan de repente…

source: let me pick something good for you. wait a second.
es_419: Deja que yo te elija algo que te guste. Un segundo.

source: He couldn’t come here with us...
es_419: No pudo venir con nosotras.

source: Ah, I see.
es_419: Ah, ya veo.

source: ...now, I just want to...
es_419: tan solo quiero…

source: make sure you don't skip any part!
es_419: ¡Que no se te escape ni un detalle!

source: how should I do it?
es_419: ¿Cómo lo hago?

source: I can't remember what happened...
es_419: No recuerdo lo que pasó…

source: it's not your fault.
es_419: No es tu culpa.

source: To be honest, I don't wanna go home.
es_419: A decir verdad, no quiero ir a casa.

source: (Continues to look for her cat.)
es_419: (Sigue buscando a la gata.)

source: you made me do this!
es_419: ¡Me obligas a hacerlo!

source: are you seeing another girl?
es_419: ¿Estás saliendo con otra chica?

source: I'm sorry for making you worry.
es_419: Perdón por haberte preocupado.

source: yeah, you're the only one who hasn't changed.
es_419: Sí, tú eres la única que no ha cambiado.

source: You mean, now?!
es_419: Te refieres… ¡¿ahora?!

source: You two make a perfect couple!
es_419: ¡Son una pareja perfecta!

source: Take her to the clinic, I'm not on duty right now.
es_419: Llévala al hospital. No estoy trabajando ahora.

source: BZZT
es_419: BZZZ

source: isn't that gavin?
es_419: ¿Ese no es Gavin?

source: You kept yourself busy at the hospital!
es_419: ¡Siempre estabas muy ocupado en el hospital!

source: you were in 2003, right?
es_419: Estuviste en el 2003, ¿no?

source: you'd better be prepared from now on...
es_419: Será mejor que te prepares a partir de ahora…

source: however, because we weren't on a good term, I decided to leave without her.
es_419: Pero como las cosas no estaban bien entre nosotros, decidí volver solo.

source: ah, only Ara's bedroom changed...
es_419: Ah, solo el cuarto de Ara cambió…

source: ...they must have set this up to prevent me from escaping.
es_419: … Lo deben haber puesto para evitar que me escape.

source: (The Ezra whom Kala remembers)
es_419: (El Ezra que Kala recuerda)

source: bad things might happen if I'm being too emotional.
es_419: Las cosas podrían ir mal si me pongo muy sentimental.

source: 5 minutes later
es_419: 5 minutos después

source: When you went missing, I figured you became a victim of human trafficking.
es_419: Cuando desapareciste, pensé que habías sido víctima de la trata de personas,

source: however, her dad didn't allow her to go with us. that's why she ran away from home.
es_419: Pero su papá no la dejaba ir con nosotros y por eso se escapó de la casa.

source: Answer me.
es_419: Contesta.

source: you guessed it right...
es_419: Así es…

source: since it's getting dark now.
es_419: ya se está haciendo de noche.

source: didn't you make fun of it yesterday?
es_419: ¿No te burlabas de eso ayer?

source: No, I didn't!
es_419: ¡Claro que no!

source: it's still bullsh*t!
es_419: ¡Sigue sonando ridículo!

source: come to think of it, it makes sense. he's seven years older than me now.
es_419: Ahora que lo pienso, tiene razón. Ahora es siete años más grande que yo.

source: but mom said--
es_419: Pero mamá dijo…

source: someone told you to focus?
es_419: ¿Alguien te dijo que lo hicieras?

source: What's wrong?
es_419: ¿Qué pasa?

source: ...you're a time traveler.
es_419: puedes viajar en el tiempo.

source: I don't know what's going on, but...
es_419: No sé qué está pasando, pero…

source: European girls are usually like that, they have a different vibe.
es_419: Las chicas europeas suelen ser así, tienen otro estilo.

source: SO NAIVE
es_419: QUÉ INOCENTE

source: it's all of you who changed a lot.
es_419: Todos ustedes sí cambiaron un montón.

source: at first, I thought gavin gave that bracelet to ezra,
es_419: Al principio, creí que Gavin le había dado el brazalete a Ezra.

source: what are you doing in Bali?!
es_419: ¿Qué haces en Bali?

source: Come on, get up!
es_419: ¡Vamos! ¡Arriba!

source: I'm so annoyed!
es_419: ¡Qué rabia!

source: She has stopped crying, huh?
es_419: Parece que ya dejó de llorar…

source: Still a BlackBear, but it's dead...
es_419: Sigue siendo un BlackBear, pero se apagó.

source: no. today is my schedule to push rank* with my friends.
es_419: No. Ya arreglé con mis amigos que hoy subíamos de rango*.

source: instead of thinking about what had happened,
es_419: En lugar de pensar en todo lo que pasó,

source: turned out that I was right.
es_419: Pero parece que tenía razón.

source: maybe next time, okay?
es_419: Tal vez la próxima, ¿sí?

source: Well, sorry if I couldn’t be someone you wanted me to be!
es_419: Bueno, entonces, ¡perdóname por no ser lo que querías que fuera!

source: BYE!
es_419: ¡ADIÓS!

source: let's go!
es_419: ¡Vamos!

source: the sky is clear blue, not red or purple like you said.
es_419: El cielo es azul, no es rojo ni púrpura como dices.

source: it means I should've graduated...
es_419: Significa que yo debería haberme graduado…

source: GULP
es_419: GLU

source: she tried to digest everything during our flight.
es_419: Trató de digerir todo durante el vuelo.

source: I wanted to asked ezra about this,
es_419: Quería preguntarle a Ezra sobre eso,

source: THE NEXT DAY
es_419: AL DÍA SIGUIENTE

source: ...but he would say no.
es_419: Pero decía que no.

source: oh, right! say hi to lenca...
es_419: ¡Ah, cierto! Saluda a Lenca por mí…

source: what are you doing now, gavin?
es_419: ¿Y ahora qué haces, Gavin?

source: I'll have a talk with you after this.
es_419: ¡Hablaré contigo después de esto!

source: you're much taller!
es_419: ¡Eres mucho más alto!

source: once I got back from bali, I rushed to lembang for kala.
es_419: Tan pronto como llegué de Bali, me fui corriendo a Lembang por Kala.

source: You really sound like a country person coming from some remote area,
es_419: Pareces una campesina que viene de alguna zona muy remota,

source: Did you just request a taxi with your phone?!
es_419: ¡¿Acabas de pedir un taxi con el teléfono?!

source: I still love him so much since those seven years feels like yesterday to me.
es_419: Yo lo sigo amando igual a él, porque esos siete años no pasaron para mí.

source: unlike back in 2013.
es_419: No es como en el 2013.

source: no, hey!!!
es_419: ¡¡No, espera!!

source: ...together!
es_419: … ¡Juntos!

source: Do you think he'll let us go?
es_419: ¿Crees que nos va a dejar ir?

source: I've felt alone all this time...
es_419: Me sentía muy sola todo este tiempo.

source: you're not doing anything, right?
es_419: Tú no estás haciendo nada, ¿no?

source: FLUTTER
es_419: SONROJADA

source: ...Until I am Ready.
es_419: hasta que esté lista.

source: ingrid's parents are going on their second honeymoon.
es_419: Los papás de Ingrid van a festejar su segunda luna de miel.

source: because I went missing for seven years.
es_419: porque estuve perdida por siete años.

source: talking about it, how did you manage to go back to bali?
es_419: Ahora que lo mencionas, ¿cómo hiciste para volver a Bali?

source: it's an officer's duty.
es_419: Es el deber de todo oficial.

source: if only we didn't go to bali--
es_419: Si no hubiéramos ido a Bali…

source: argh!
es_419: ¡AAAH!

source: but somehow...
es_419: Pero aun así…

source: Why is she suddenly talking like that?
es_419: ¿Por qué me habla así tan de repente?

source: walk away
es_419: se marcha

source: we argued before we went to Bali. you said you hate Bali.
es_419: Discutimos antes de venir a Bali. Dijiste que lo odiabas.

source: CLASP
es_419: AGARRA

source: Excuse me, I have to take this.
es_419: Perdón, tengo que contestar.

source: since it would be seven years ago for her.
es_419: Porque para ella han pasado siete años.

source: ...Whether he studies hard or not, he's the top student at school.
es_419: No importa si estudia mucho o no, es el mejor estudiante de la escuela.

source: here, I'll sent you her picture.
es_419: Mira, te envío una foto.

source: why didn't they tell me early on?
es_419: ¿Por qué no me lo dijeron antes?

source: you need to figure out a way to go back on your own.
es_419: Tienes que encontrar la manera de volver por tu cuenta.

source: CHAPTER 13:
es_419: CAPÍTULO 13:

source: if something happens, I'll be the one who's responsible!!!
es_419: Si algo te pasa, ¡¡yo seré el único responsable!!

source: ...and he didn't say anything.
es_419: No dijo ni una palabra.

source: at least, tell me why she can't go--
es_419: Al menos dígame por qué no puede ir…

source: I think I'll just do it tomorrow,
es_419: Creo que lo haré mañana,

source: Look at these two, flirting with each other!
es_419: ¡Mírenlos a los dos! ¡No dejan de coquetearse!

source: what if I disappear again?
es_419: ¿Y si desaparezco de nuevo?

source: no, you can't! they're mine!!!
es_419: ¡No, no puedes! ¡¡Son míos!!

source: (The Ezra who's in front of Kala)
es_419: (El Ezra que está frente a ella)

source: Whatever choice you make, it comes with a consequence.
es_419: Sea cual sea la decisión que tomes, habrá consecuencias.

source: Your grandma...
es_419: Tu abuela…

source: *A school counselor: a teacher trained to give guidance on personal, social, or psychological problems.
es_419: *Consejero escolar: profesor capacitado para orientar sobre problemas personales, sociales o psicológicos.

source: we would be wealthy!
es_419: ¡seríamos ricas!

source: Doesn't everyone use BlackBear Messenger?!
es_419: ¡¿Ya nadie usa los mensajes de BlackBear?!

source: do you want a glass of boba? it's a drink with tapioca balls.
es_419: ¿Quieres un té de burbujas? Tiene bolitas de tapioca.

source: how long are you going to be trapped in your past, ezra?
es_419: ¿Cuánto tiempo más piensas seguir atrapado en el pasado?

source: Wait a second.
es_419: Un segundo.

source: I didn't really mean to say that...
es_419: No quise decir eso.

source: And maybe this is the consequence I have to face...
es_419: Y tal vez esta sea la consecuencia que deba afrontar…

source: forgive me, ezra...
es_419: Perdóname, Ezra.

source: ...and I said...
es_419: … Y te dije…

source: huh?!
es_419: ¡¿Eh?!

source: no wonder I'm the one who got this ability to travel through time, not her.
es_419: No me extraña que sea yo quien tenga la habilidad de viajar en el tiempo y no ella.

source: but I was young, then.
es_419: Era joven en aquel entonces.

source: it's more like...
es_419: Más bien…

source: Her dad picked her up straight from school right after the bell rings.
es_419: Su papá la fue a buscar a la escuela justo cuando sonó el timbre.

source: seven years was a long time...
es_419: Siete años es mucho tiempo…

source: CHAPTER 20 :
es_419: CAPÍTULO 20:

source: I got 100+ for my final math exam.
es_419: Me saqué un 100+ en el examen de matemáticas.

source: He always says no to anything I say.
es_419: Siempre me dice que no a todo.

source: yeah, it would be best.
es_419: Sí, pienso lo mismo.

source: I got a present for you.
es_419: Tengo un regalo para ti.

source: No, I don't actually need to go to the bathroom.
es_419: A decir verdad, no tengo que ir al baño.

source: I thought you were dead...
es_419: Yo creía que estabas muerta…

source: I'm off. till next time.
es_419: Me voy. Hasta la próxima.

source: promise me?
es_419: ¿Me lo prometes?

source: I finally get to see the sea.
es_419: Por fin puedo venir a ver el mar.

source: I'm in Bali.
es_419: Estoy en Bali.

source: how would all this benefit me?
es_419: ¿Cómo me puedo beneficiar con esto?

source: happy birthday, kala!
es_419: ¡Feliz cumpleaños, Kala!

source: Are you having fun?
es_419: ¿Te estás divirtiendo?

source: Are you sure you didn't hit anything?
es_419: ¿Segura que no te golpeaste con nada?

source: Thank you, Mr. Agung, for your help with everything.
es_419: Gracias, Sr. Agung, por ayudarnos con todo esto.

source: how can there be high and low tides?
es_419: ¿Cómo es eso de las mareas altas y bajas?

source: Let's say I've been asleep for seven years.
es_419: Digamos que estuve dormida siete años.

source: I saw it coming...
es_419: Ya me lo esperaba…

source: HUFT
es_419: UFFF

source: CHAPTER 14:
es_419: CAPÍTULO 14:

source: RUMBLE
es_419: RUUUM

source: Prove to me that you're really Ezra!
es_419: ¡Demuéstrame que de verdad eres Ezra!

source: This is the difficult choice high school student Kala finds herself faced with when her friends offer to take her on a new years getaway.
es_419: Esta es la difícil decisión a la que se enfrenta Kala, una estudiante de secundaria, cuando sus amigos la invitan a hacer una escapada de fin de año.

source: You hear me, Kala?
es_419: ¿Me oíste, Kala?

source: oh my gosh!
es_419: ¡Ay, caray!

source: I-I...
es_419: N-no…

source: WOOOW!
es_419: ¡GUAAUU!

source: Thank you so much, Ezra!
es_419: ¡Muchas gracias, Ezra!

source: You alright?
es_419: ¿Estás bien?

source: and bali was supposed to be a place for us to reconcile.
es_419: Y se suponía que el viaje a Bali serviría para reconciliarnos.

source: well, who cares?
es_419: Bueno, ¿qué importa?

source: gavin came because ezra told him that I had come back.
es_419: Gavin vino porque Ezra le contó que había vuelto.

source: 9:06 PM PM
es_419: 9:06 p. m.

source: Dad won't listen.
es_419: Papá nunca me va a escuchar.

source: ...what I experienced today was beyond the natural world.
es_419: … creo que lo que viví hoy va mucho más allá del mundo real.

source: Ezra introduced her right away, she's so pretty.
es_419: Ezra me la presentó enseguida. Es muy bonita.

source: CHAPTER 1:
es_419: CAPÍTULO 1:

source: I feel like I'm being confined by my own parents...
es_419: Me siento encerrada por mis propios padres…

source: I'm the one who whisked you away!
es_419: ¡Fui yo el que te sacó de ahí!

source: How could you say that when you knew she was gone?!!
es_419: ¡¿Cómo puedes decir eso cuando sabes que se ha ido?!

source: What happened?
es_419: ¿Qué pasó?

source: GURGLE
es_419: GLUP

source: Then we'll relax at the beach tonight, waiting for New Year's Eve.
es_419: Y a la noche nos vamos a relajar en la playa y a esperar el final del año.

source: why the long face?
es_419: ¿Por qué la cara larga?

source: CHAPTER 11:
es_419: CAPÍTULO 11:

source: here's my old phone.
es_419: Toma, mi teléfono viejo.

source: What?
es_419: ¿Qué?

source: ...but knowing and experiencing,
es_419: … pero el conocimiento y la experiencia,

source: she then told me something when we arrived.
es_419: Y después me dijo algo cuando llegamos.

source: I went to bali only because lenca insisted me to go.
es_419: Fui a Bali solo porque Lenca me insistió para que fuera.

source: for me, yesterday was yesterday, not seven years like how you experienced it.
es_419: Para mí, ayer fue ayer. No viví esos siete años como tú lo has hecho.

source: you're still here?!
es_419: ¡¿Sigues aquí?!

source: I just want to see and hug Grandma.
es_419: Quiero ver a mi abuela y abrazarla.

source: What time is it?
es_419: ¿Qué hora es?

source: Get out of my sight!
es_419: ¡No quiero verte más!

source: then what would you do if you could travel to the past?
es_419: ¿Tú qué harías si pudieras viajar al pasado?

source: you can go back to the past, right?
es_419: puedes volver al pasado, ¿no?

source: Umm, thank you!
es_419: Mmm… ¡Gracias!

source: ...you and your loved one will be together forever after, like those love locks.
es_419: … la persona que amas y tú estarán juntos para siempre, como los candados.

source: ...have to hit me?
es_419: que golpearme?

source: I guess you were serious about becoming an astronaut.
es_419: Supongo que lo de ser astronauta iba en serio.

source: Huh?
es_419: ¿Eh?

source: There's no way you could get pregnant because of that.
es_419: Es imposible que te quedes embarazada por eso.

source: Don't ever think about going to Bali!
es_419: ¡Ni se te ocurra ir a Bali!

source: as the sun went down, ara took me home.
es_419: Y cuando se puso el sol, Ara me llevó a casa.

source: RUSTLE
es_419: GRRRR

source: I can't believe I got to come to Bali.
es_419: No puedo creer que logré venir a Bali.

source: I know you tried to help me.
es_419: Sé que intentaron ayudarme,

source: he's been so helpful so far, and yet I...
es_419: Me ayudó tanto hasta ahora, y aún así yo…

source: she just found out that ingrid dropped out.
es_419: Se acaba de enterar de que Ingrid dejó la universidad.

source: I asked Ara to play any K-dramas for me.
es_419: Le pedí a Ara que me mostrara algunas series.

source: Go to bed, kids need more sleep.
es_419: Ve a dormir. Los niños tienen que dormir más.

source: I was too afraid that I would wake up in the past.
es_419: Tenía mucho miedo de despertar en el pasado.

source: CHAPTER 6:
es_419: CAPÍTULO 6:

source: ...but I have a hunch that he knows...
es_419: … pero tengo el presentimiento de que sabe…

source: But that's true, isn't it?
es_419: Pero es verdad, o no?

source: GRRRTT
es_419: CRRRTT

source: I thought she died from drowning or became a victim of human trafficking.
es_419: pensé que se había ahogado o que era víctima de trata de personas.

source: SQUISH
es_419: APRIETA

source: let me help you
es_419: Déjeme ayudarlo

source: Nothing changed.
es_419: No cambió nada.

source: I'm not coming with you guys.
es_419: Yo no voy con ustedes.

source: There's another side of Ezra...
es_419: Esta es la otra cara de Ezra…

source: Did Ms. Maharani leave for Bali yet?
es_419: ¿La señora Maharani ya está viniendo para Bali?

source: it's not that, I just asked for help.
es_419: Nada que ver. Solo te pedí ayuda.

source: Can you imagine that?
es_419: Piénsenlo…

source: I'm not ready to see him.
es_419: No estoy lista para verlo.

source: How to forget what happened yesterday?
es_419: ¿Cómo olvidar lo que pasó ayer?

source: We're at the beach!!!
es_419: ¡Estamos en la playa!

source: it's very foolish of me for not knowing how the nature works.
es_419: Soy una tonta por no saber cómo funciona la naturaleza.

source: I watched K-dramas all night long.
es_419: estuve mirando series toda la noche.

source: it's because they remind me of my own kids.
es_419: Me recuerdan a mis propios hijos.

source: ...and maybe I can travel back to make things right.
es_419: Y tal vez pueda viajar de vuelta para arreglar las cosas.

source: You should pinch me then.
es_419: Entonces pellízcame tú.

source: in the 531,345,578th second of my life...
es_419: A los 531 345 578 segundos de mi vida…

source: well, the answer is at my house.
es_419: La respuesta está en mi casa.

source: ara and I went home before the sun went down.
es_419: Ara y yo nos fuimos a casa antes de que se pusiera el sol.

source: She went missing in 2014, about 7 years ago.
es_419: Pero desapareció en 2014, hace 7 años.

source: STAB
es_419: TAC

source: turns out gavin still keeps the bracelet with him.
es_419: Parece que Gavin aún conserva su brazalete.

source: well, I know the theory...
es_419: Bueno, sé la teoría…

source: What, my mom is coming?!
es_419: ¿Qué? ¡¿Está viniendo mi mamá?!

source: hold my hand just for two seconds so that I'm ready for this.
es_419: Toma mi mano tan solo dos segundos, así me sentiré más preparada.

source: My mom was asking.
es_419: Mi mamá me está preguntando.

source: now you've got to control your emotion...
es_419: Debes aprender a controlar tus emociones

source: oh, yeah.
es_419: Ah, sí.

source: Talking to him is like talking to a wall.
es_419: Hablar con él es como hablar con una pared.

source: why don't you do it now?
es_419: ¿Y por qué no ahora?

source: A FOOL
es_419: TONTA

source: Huh?!!
es_419: ¡¿Eh?!

source: we need to explain everything to kala...
es_419: Tenemos que explicarle todo a Kala…

source: SLAM
es_419: BLAM

source: I Think it was this way...
es_419: Creo que era por aquí…

source: if I take you to Lembang?
es_419: ir a Lembang conmigo?

source: how sad...
es_419: Qué triste.

source: after I dropped out, I started filming beauty tutorials, a lot of people actually enjoy them.
es_419: Cuando dejé la universidad, comencé a grabar videos de belleza. A mucha gente le gusta.

source: (their mom ended up opening the door)
es_419: (al final su mamá abrió la puerta)

source: I'm--
es_419: Estoy…

source: Wait, what?!
es_419: Espera, ¡¿qué?!

source: so you'll travel back to the year 2013 just to get back together with him?
es_419: ¿Entonces vas a viajar al 2013 solo para estar con él?

source: *one of Muslim’s religious holidays.
es_419: *fiesta religiosa de los musulmanes.

source: when gavin said that...
es_419: Cuando Gavin dijo eso…

source: how could you two toy with my feelings?
es_419: ¿Cómo pueden jugar así con mis sentimientos?
